import {Roles} from "@/types/enums/Role";
import {DeleteUserText} from "./types";

export const DELETE_USER_TEXT: Record<Roles | "_", DeleteUserText> = {
    [Roles.patient]: {
        buttonText: "Видалити пацієнта",
        titleText: "Ви впевнені, що хочете видалити пацієнта?",
        contentText: "Усі назначені тести будуть скасовані, а пацієнт буде знятий з обліку у всіх лікарів.",
    },
    [Roles.doctor]: {
        buttonText: "Видалити лікаря",
        titleText: "Ви впевнені, що хочете видалити лікаря?",
        contentText:
            "Усі пацієнти, пов'язані з цим лікарем, будуть зняті з його/її обліку. " +
            "Усі назначені ним/нею тести теж будуть скасовані.",
    },
    [Roles.admin]: {
        buttonText: "Видалити адміністратора",
        titleText: "Ви впевнені, що хочете видалити адміністратора?",
        contentText: "Після видалення, цей адміністратор більше не зможе керувати системою.",
    },
    _: {
        buttonText: "Видалити користувача",
        titleText: "Ви впевнені, що хочете видалити користувача?",
        contentText: "Усі дані, пов'язані з цим користувачем, будуть втрачені.",
    },
};